tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "little-angry-clouds/my-brews"
tap "shihanng/gig"
tap "wvanlint/twf"
brew "ack"
brew "antigen"
brew "python@3.8"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "python@3.9"
brew "bind", restart_service: true
brew "coreutils"
brew "nghttp2"
brew "curl"
brew "direnv"
brew "exa"
brew "fasd"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "fzf"
brew "gawk"
brew "libmpc"
brew "gcc"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-flow"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg", link: false
brew "go@1.14"
brew "go@1.15"
brew "grep"
brew "gzip"
brew "helm", link: false
brew "hey"
brew "htop"
brew "shared-mime-info"
brew "imagemagick"
brew "jq"
brew "kind"
brew "krew"
brew "kube-ps1"
brew "ldns"
brew "liquidprompt"
brew "make"
brew "mas"
brew "minikube"
brew "nodenv"
brew "openssh"
brew "pass"
brew "peco"
brew "perl"
brew "pssh"
brew "python@3.7"
brew "rakudo-star"
brew "ripgrep"
brew "shellcheck"
brew "stern"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "little-angry-clouds/my-brews/helmenv"
brew "little-angry-clouds/my-brews/kbenv"
brew "shihanng/gig/gig"
brew "wvanlint/twf/twf", args: ["HEAD"]
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "adoptopenjdk9"
cask "alacritty"
cask "authy"
cask "docker"
cask "fanny"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-profont-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "fork"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kitty"
cask "postman"
cask "rectangle"
cask "skim"
cask "skype"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Clocker", id: 1056643111
mas "GarageBand", id: 682658836
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
