# this a dump from "brew bundle dump"
# todo fixup this file. separate things out. 
# comments on "why" for the installations.
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "antigen"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "fasd"
brew "ghostscript"
brew "git"
brew "git-flow"
brew "openssl@1.1"
brew "gnutls"
brew "gnupg", link: false
brew "jq"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "python@3.8"
brew "liquidprompt"
brew "make"
brew "mas"
brew "openssh"
brew "shellcheck"
brew "stern"
brew "telnet"
brew "tmux"
brew "wget"
brew "yq"
brew "zsh"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "adoptopenjdk9"
cask "alacritty"
cask "authy"
cask "docker"
cask "fanny"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kitty"
cask "postman"
cask "rectangle"
cask "skype"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
