tap "homebrew/cask"

brew "fasd"
brew "git"
brew "git-flow"
brew "liquidprompt"
brew "openssh"
brew "openssl@1.1"
brew "wget"
# pyenv isn't working seamlessly. need to figure out the 
# correct installation and the correct configs. 
# brew "pyenv"
# brew "pyenv-virtualenv"
# pyenv-plugins
# "readline" "xz" for pyenv
# some other workaround for installing both python 2 and python 3. 
brew "telnet"
brew "python"
brew "python@2"

cask "docker"
cask "dropbox"
cask "firefox"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "jetbrain-toolbox"
cask "keepassxc"
cask "postman"
cask "spectacle"
cask "sublime-merge"
cask "sublime-text"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "spotify"
cask "slack"
cask "evernote"
cask "whatsapp"
cask "robo-3t"
cask "mongodb-compass-community"
cask "mongodb"
cask "zoomus"
cask "skype"


cask "pritunl"
cask "tunnelblick"
cask "authy"

tap elastic/tap
brew "elastic/tap/elastic-search-full"

tap "adoptopenjdk/openjdk"
cask "adoptopenjdk11"
cask "adoptopenjdk9"
cask "adoptopenjdk8"

brew "jenv"