tap "homebrew/cask"

brew "fasd"
brew "git"
brew "git-flow"
brew "liquidprompt"
brew "openssh"
brew "openssl@1.1"

cask "docker"
cask "dropbox"
cask "firefox"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "jetbrain-toolbox"
cask "keepassxc"
cask "postman"
cask "spectacle"
cask "sublime-merge"
cask "sublime-text"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "spotify"

cask "pritunl"
cask "tunnelblick"